"use strict";

/*
Необходимо попросить пользователя ввести три числа.
Необходимо создать функцию, в которую мы должны передать эти три числа.
Функция должна определить максимальное, среди переданных ей значение и 
вывести сообщение: "Максимальное значение среди чисел N1, N2, N3 равно N."

Примечание: Условимся, что пользователь всегда вводит корректные значения, 
три числа. Проверять их не нужно.
*/
/*
let num1 = +parseInt(prompt('Введите 1 число:'));
let num2 = +parseInt(prompt('Введите 2 число:'));
let num3 = +parseInt(prompt('Введите 3 число:'));

alert(`Максимальное значение среди чисел ${num1}, ${num2}, ${num3} равно ${MaxNumber(num1, num2, num3)}.`)

function MaxNumber(num1, num2, num3){
    return Math.max(num1, num2, num3)
};

*/